<?php

use App\Models\PlateNumberColor;
use Illuminate\Database\Seeder;

class PlateNumberColorTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $abuDhabi       = ['احمر', 'ازرق', 'ابيض', 'اخضر', 'برتقالى', 'اصفر', 'رمادى', 'هيئة دبلوماسية', 'منطقة دولية', 'تشريفات', 'كلاسيكية', 'الفئة الاولي', 'الفئة الثانية', 'الفئة الثالثة', 'الفئة الرابعة', 'الفئة الخامسة', 'الفئة السادسة', 'الفئة السابعة', 'الفئة الثامنة', 'الفئة التاسعة', 'الفئة العاشرة', 'الفئة الحادية عشر', 'الفئة الثانية عشر', 'الفئة الثالثة عشر', 'الفئة الرابعة عشر', 'الفئة الخامسة عشر', 'الفئة السادسة عشر', 'الفئة السابعة عشر', 'الفئة الثامنة عشر', 'الفئة الخمسون'];
        $dubai          = ['احمر', 'ازرق', 'ابيض', 'اخضر', 'اسود', 'اصفر', 'منظومة دولية', 'ضيافة', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z', 'شرطة', 'ازرق', 'برتقالى', 'هيئة قنصلية', 'كلاسيكية', 'كود 2', 'كود 3', 'كود 4', 'كود 5', 'كود 6', 'كود 7', 'كود 8', 'كود 9', 'علم دبى', 'دراجة نارية', 'دراجة نارية ترفيهية', 'اجرة', 'نقل عام', 'تجارية', 'تصدير', 'هيئة سياسية', 'حكومية', 'مقطورة', 'نقل بيانات', 'تعليم', 'AA'];
        $sharjah        = ['ازرق', 'ابيض', 'اخضر', 'برتقالى', 'اصفر', 'تشريفات', 'ابيض + ازرق', 'كلاسيكية', 'الفئة الاولي', 'الفئة الثانية', 'الفئة الثالثة', 'الفئة الرابعة', 'الفئة الخامسة', 'الفئة السادسة', 'الفئة السابعة', 'الفئة الثامنة', 'الفئة التاسعة', 'الفئة العاشرة', 'دراجة نارية ترفيهية'];
        $ajman          = ['احمر', 'ازرق', 'ابيض', 'اخضر', 'برتقالى', 'اصفر', 'كلاسيكية', 'الفئة الاولي', 'الفئة الثانية', 'الفئة الثالثة', 'الفئة الرابعة', 'الفئة الخامسة', 'الفئة السادسة', 'الفئة السابعة', 'الفئة الثامنة', 'الفئة التاسعة', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z'];
        $ummAlQuwain    = ['احمر', 'ازرق', 'ابيض', 'اخضر', 'الفئة الاولي', 'الفئة الثانية', 'الفئة الثالثة', 'الفئة الرابعة', 'الفئة الخامسة', 'الفئة السادسة', 'الفئة السابعة', 'الفئة الثامنة', 'الفئة التاسعة', 'الفئة العاشرة', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z', 'تعليم', 'UA'];
        $rasAlKhaimah   = ['احمر', 'ازرق', 'ابيض', 'اخضر', 'اصفر', 'ضيافة', 'الفئة الاولي', 'الفئة الثانية', 'الفئة الثالثة', 'الفئة الرابعة', 'الفئة الخامسة', 'الفئة السادسة', 'الفئة السابعة', 'الفئة الثامنة', 'الفئة التاسعة', 'الفئة العاشرة', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z', 'البرج', 'احمر + ابيض', 'كلاسيكية'];
        $fujairah       = ['احمر', 'ازرق', 'ابيض', 'اخضر', 'الفئة الاولي', 'الفئة الثانية', 'الفئة الثالثة', 'الفئة الرابعة', 'الفئة الخامسة', 'الفئة السادسة', 'الفئة السابعة', 'الفئة الثامنة', 'الفئة التاسعة', 'الفئة العاشرة', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z'];
        foreach ($abuDhabi as $name)
        {
            PlateNumberColor::create([
                'name' => $name,
                'plate_number_source_id' => 1,
            ]);
        }
        foreach ($dubai as $name)
        {
            PlateNumberColor::create([
                'name' => $name,
                'plate_number_source_id' => 2,
            ]);
        }
        foreach ($sharjah as $name)
        {
            PlateNumberColor::create([
                'name' => $name,
                'plate_number_source_id' => 3,
            ]);
        }
        foreach ($ajman as $name)
        {
            PlateNumberColor::create([
                'name' => $name,
                'plate_number_source_id' => 4,
            ]);
        }
        foreach ($ummAlQuwain as $name)
        {
            PlateNumberColor::create([
                'name' => $name,
                'plate_number_source_id' => 5,
            ]);
        }
        foreach ($rasAlKhaimah as $name)
        {
            PlateNumberColor::create([
                'name' => $name,
                'plate_number_source_id' => 6,
            ]);
        }
        foreach ($fujairah as $name)
        {
            PlateNumberColor::create([
                'name' => $name,
                'plate_number_source_id' => 7,
            ]);
        }

    }
}
