<ol style="padding-inline-start: 20px">
    <li>اتعهد بتسديد اجرة الإصلاح نقداٌ عند السيارة بما فى ذلك قيمة قطع الغيار والمواد الاخرى.</li>
    <li>للورشة الحق فى فك السيارة لإجراء الإصلاحات اللازمة. كما لها الحق فى تجربة السيارة قبل الإصلاح وبعده خارج الورشة.</li>
    <li>ان الورشة غير مسؤلة عن الأغراض الموجودة بالسيارة التي لم يعلن عنها صاحبها عند تسليم السيارة كما لا يحق له المطالبة فى حالة فقدانها او تلفها عند تسليم السيارة.</li>
    <li>واذا تاخرت عن استلام السيارة بعد عشرة ايام من انتهاء الإصلاح اتعهد بدفع 50 ريال عن كل يوم.</li>
    <li>اذا تاخرت عن استلام السيارة بعد 3 شهور تعتبر الورشة غير مسؤلة عن السيارة.</li>
    <li>عند استلام المركز سيارة محملة على سطحة المركز غير مسؤل عن اى اعطال تظهر فى السيارة داخل المركز.</li>
    <li>أقر أنا بالموافقة على نقل السيارة سواء عن طريق سطحة أو عن طريق سائق إلى المركز الرئيسى بجنوب الرياض إذا قرر المهندس المسؤل الحاجة إلى ذلك.</li>
    <li>إضافة 15% على قيمة قطع الغيار فى حال توفيرها من قبل المركز.</li>
    <li>عند استلام العميل للسيارة ، الورشة غير مسؤولة عن قطع الغيار القديمة المستبدلة في حال لم يستلمها العميل قبل خروج السيارة من المركز.</li>
</ol>
