<ol style="padding-inline-start: 20px">
    <li>القطع الخاصة التي يتم طلبها للعميل ويتم تعميدها لا ترجع ولا تستبدل إطلاقاً.</li>
    <li>العميل يتحمل كامل المسؤولية عند طلب القطع بموجب رقم الهيكل المقدم من قبله وتم تعميد الطلب بموجبه تفادياً لإختلافها.</li>
    <li>لا يحق للعميل إلغاء أو التراجع عن الطلب الخارجي بعد التعميد, تحت أي ظرف ولا يمكن إسترجاع المبلغ المدفوع.</li>
    <li>الضمان لا يشمل قطع الغيار سواء القطع الميكانيكية أو الكهربائية مالم تنص الفاتورة على غير ذلك.</li>
    <li>الضمان يكون على العمل في حال ثبت وجود خطأ بالتركيب من قبل المركز.</li>
    <li>مدة ضمان العمل تختلف بناء على الصيانة التي يتم عملها ويتم تحديد مدة الضمان بالفاتورة.</li>
    <li>ضمان بطاريات BMW يلغى في حال وجود تفريغ كهرباء أو خلل بأحد القطع الكهربائية.</li>
    <li>بعد فحص السيارة وإرسال عرض السعر للعميل وأخذ الموافقة منه وبدء العمل , أثناء الفك والتركيب إذا تبين وجود قطع إضافية تحتاج تغيير ولم يتم ذكرها بعرض السعر , يتم إبلاغ العميل أولاً قبل تغييرها.</li>
    <li>في حال تعميد العميل للمركز بتوفير قطع الغيار يتم إعطاءه فاتورة مصدرة من مركز الشيخ مزودة بأرقام قطع الغيار ولا يحق للعميل المطالبة بأصل فاتورة الشراء من المصدر.</li>
    <li>طلبيات جدة تحتاج من 3 إلى 8 أيام عمل حتى تصل.</li>
    <li>طلبيات ألمانيا تحتاج من 35 إلى 60 يوم عمل حتى تصل.</li>
</ol>
